{
  "backend/main.mo": "Main Motoko actor for the CRYONEX backend defining all core types (Player, UserProfile, Mission, Skill, etc.) and game logic including combat, stat management, daily tasks, missions, and questionnaire handling on the Internet Computer.",
  "feature_evidence.json": "Feature evidence report confirming that the rank progression thresholds in `frontend/src/utils/rankUtils.ts` were updated to new level ranges from E Rank Hunter (Lvl 1–5) through Shadow Monarch (Lvl 60+).",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing the purpose and key changes of each component, page, hook, and configuration file in the CRYONEX frontend.",
  "frontend/.ic-assets.json": "ICP asset configuration file specifying HTTP headers (Content-Type, Cache-Control, security headers) for all static asset types served by the frontend canister.",
  "frontend/index.css": "Empty global CSS file for the frontend application.",
  "frontend/index.html": "HTML entry point for the CRYONEX PWA, including meta tags for caching, PWA manifest, Apple mobile web app support, favicon links, and Google Fonts (Inter) import.",
  "frontend/public/manifest.json": "PWA manifest for CRYONEX defining app name, icons (192×192 and 512×512), display mode, theme/background colors, and categories (productivity, lifestyle, games).",
  "frontend/public/service-worker.js": "Service worker implementing an offline-first caching strategy with separate caches for static assets, runtime, and API calls, draft-environment detection to bypass caching, and stale-while-revalidate for ICP canister requests.",
  "frontend/src/App.tsx": "Root React component managing authentication state, actor initialization with timeout/retry logic, profile and questionnaire loading, and routing between app screens (dashboard, missions, stats, skills, profile, customTasks).",
  "frontend/src/components/auth/InitializationError.tsx": "Displays a full-screen error UI when app initialization fails, with options to retry or clear cache and retry, plus collapsible technical details and special messaging for draft environments.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling authentication state transitions and showing a spinner during processing.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Displays AI-generated daily tasks with incomplete and completed sections, supports marking tasks complete, and auto-refreshes at midnight UTC.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Simple display component that shows the current device date using the useDeviceDate hook with a calendar icon.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Simple display component that shows a live-updating clock using the useRealTimeClock hook with a clock icon.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app shell providing a header with logo and login button, a collapsible sidebar navigation with hamburger menu, and a scrollable content area.",
  "frontend/src/components/layout/OfflineIndicator.tsx": "Fixed-position banner that appears at the top of the screen when the user is offline, using the useOnlineStatus hook.",
  "frontend/src/components/missions/CustomMissionForm.tsx": "Form component for creating custom missions with title, description, XP, and coin reward fields, including client-side validation and submission via a mutation hook.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "Confirmation alert dialog for permanent account deletion, listing all data that will be removed and requiring explicit user confirmation.",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "A multi-step dialog component that presents 5 personalization questions with radio button options, tracks answers, shows progress, and submits results via a mutation hook.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog for new users to enter a nickname and initialize their profile, submitting via the useInitializeProfile mutation hook.",
  "frontend/src/components/stats/StatsRadarChart.tsx": "Renders a Recharts radar chart visualizing an array of bigint stat values mapped to named axes with a cyan color scheme.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "A form component for creating custom tasks with a title, XP points (1–100), and attribute points (1–10), using increment/decrement buttons and submitting via useCreateCustomTask.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Fetches and displays custom tasks in a card grid, separating active and completed tasks, with toggle-completion buttons and XP/attribute point badges.",
  "frontend/src/content/copy.ts": "Centralized UI string constants for the entire app, covering auth, profile setup, personalization questions, dashboard labels, and mission text.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous ICP backend actor based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeviceDate.ts": "A hook that returns the current date as a DD/MM/YY string and updates it automatically at midnight using a timeout-then-interval approach.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status using DFINITY's AuthClient.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom React hook that tracks browser network connectivity by listening to online/offline events and returns a boolean.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, questionnaire answers, missions, skills, and custom tasks via the canister actor.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom React hook that returns a live-updating HH:MM:SS time string, refreshed every second.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines light and dark mode CSS custom properties for a sci-fi themed color palette, and applies a background image with glass-overlay utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomTasksPage.tsx": "Page component that renders a form for creating custom tasks and a list of existing custom tasks inside styled cards.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying the user's profile stats, XP progress, rank badge, real-time clock, calendar, daily tasks, and a radar chart of skill stats.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with a hero section, login button, and a grid of feature cards highlighting the app's key capabilities.",
  "frontend/src/pages/MissionLogPage.tsx": "Displays a daily mission log page showing today's progress summary including tasks completed, missions completed, XP earned, and coins earned from completed daily tasks.",
  "frontend/src/pages/MissionsPage.tsx": "Renders the missions page with daily, repeatable, and custom user missions, supporting mission completion, custom mission creation, and deletion with confirmation dialogs.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Profile settings page allowing users to view their profile info, edit their username, log out, and delete their account with a confirmation dialog.",
  "frontend/src/pages/SkillsPage.tsx": "Displays available skills grouped by category with unlock requirements, allowing users to unlock skills if they meet level and stat prerequisites.",
  "frontend/src/pages/StatsPage.tsx": "Stats allocation page showing a radar chart of 13 attributes and controls to increment/decrement pending stat point allocations before confirming them.",
  "frontend/src/utils/cacheControl.ts": "Utility functions for managing service worker caches and registrations, including draft-environment detection that auto-clears caches and unregisters service workers on the draft domain.",
  "frontend/src/utils/rankUtils.ts": "Exports a helper function that maps a numeric player level to a rank label, color identifier, and Shadow Monarch flag based on level thresholds.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those values using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch), border radius, fonts, and accordion keyframe animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing a productivity/game app whose current task is updating hunter rank progression thresholds in rankUtils.ts to new level ranges (E rank Lvl 1–5 through Shadow Monarch Lvl 60+)."
}