{
  "backend/main.mo": "Main Motoko actor for the CRYONEX backend, defining all core data types (Player, Mission, Skill, UserProfile, etc.) and game logic including combat, stat management, daily tasks, missions, and access control.",
  "feature_evidence.json": "Feature evidence report confirming that a rank display box was added to DashboardPage.tsx, showing the user's current rank label and color derived from getRankFromLevel, placed adjacent to the level box.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing their purpose and notable implementation details across the CRYONEX React application.",
  "frontend/.ic-assets.json": "ICP asset configuration file that sets HTTP headers (Content-Type, Cache-Control, security headers) for all frontend static assets served from the Internet Computer canister.",
  "frontend/index.css": "Empty global CSS file for the frontend application.",
  "frontend/index.html": "HTML entry point for the CRYONEX PWA, including meta tags for caching, PWA manifest, Apple mobile web app tags, favicon links, and Google Fonts (Inter) import.",
  "frontend/public/manifest.json": "PWA manifest for CRYONEX defining app name, icons (192x192 and 512x512), display mode, theme/background colors, and categories for installation as a standalone app.",
  "frontend/public/service-worker.js": "Service worker implementing an offline-first caching strategy with separate caches for static assets, runtime, and API calls, with special handling to bypass caching entirely on the draft environment.",
  "frontend/src/App.tsx": "Root React component managing authentication state, actor initialization with timeout/retry logic, and routing between app screens (dashboard, missions, stats, skills, profile, customTasks) with profile setup and questionnaire flows.",
  "frontend/src/components/auth/InitializationError.tsx": "Displays a full-screen error UI when app initialization fails, with options to retry or clear caches/service workers, and shows technical details including draft environment warnings.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling authentication state transitions and showing a spinner during processing.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Displays AI-generated daily task recommendations with completion tracking, auto-refreshes at midnight UTC, and allows users to mark tasks complete for rewards.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Simple display component that shows the current device date using the useDeviceDate hook with a calendar icon.",
  "frontend/src/components/dashboard/RankInfoDialog.tsx": "Modal dialog showing the user's current rank and a full rank progression table from E Rank Hunter to Shadow Monarch based on level thresholds.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Simple display component that shows a live-updating clock using the useRealTimeClock hook with a clock icon.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app shell providing a header with logo and login button, a collapsible sidebar navigation with screen links, and a content area with offline indicator support.",
  "frontend/src/components/layout/OfflineIndicator.tsx": "Fixed-position banner that appears at the top of the viewport when the user is offline, displaying a styled warning message using the useOnlineStatus hook.",
  "frontend/src/components/missions/CustomMissionForm.tsx": "A form component for creating custom missions with title, description, XP reward, and coin reward fields, including validation and submission via the useCreateUserMission hook.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "A confirmation alert dialog that warns users about permanent account deletion and lists all data that will be removed, with Cancel and Delete Account actions.",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "A multi-step dialog questionnaire that collects user personalization answers via radio groups, showing progress and submitting all answers via the useSubmitQuestionnaireAnswers hook.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog for new users to enter a nickname and initialize their profile using the useInitializeProfile hook, blocking dismissal until submitted.",
  "frontend/src/components/stats/StatsRadarChart.tsx": "A Recharts-based radar chart component that visualizes an array of bigint stat values mapped to named axes with a styled dark theme.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "A form for creating custom tasks with a title, XP points (1–100), and attribute points (1–10), using increment/decrement buttons and submitting via the useCreateCustomTask hook.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays the user's custom tasks in a card grid, separated into active and completed sections, with toggle completion functionality via the useToggleCustomTaskCompletion hook.",
  "frontend/src/content/copy.ts": "Exports a COPY constant containing all UI text strings for the app, including labels for auth, profile setup, dashboard, missions, personalization questionnaire, and other sections.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, handling both anonymous and authenticated (Internet Identity) cases and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeviceDate.ts": "Custom hook that returns the current date formatted as DD/MM/YY and updates automatically at midnight each day.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom hook that tracks browser network connectivity by listening to online/offline events and returns a boolean isOnline value.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, questionnaire answers, missions, skills, and custom tasks, with toast notifications for success and error states.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom hook that returns the current time as a HH:MM:SS string, updating every second via setInterval.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, defines CSS custom properties for light and dark sci-fi themes (cyan/green accents), and sets a fixed background image with glass-overlay utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/CustomTasksPage.tsx": "Page component that renders the custom tasks section, displaying a task creation form and a task list inside styled cards with glass-overlay backgrounds.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user stats, level/rank badge, XP progress, coins, radar chart of stat categories, real-time clock, calendar, and a custom task form with a rank info dialog.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with a hero section, login button, and a four-card feature grid highlighting the app's key selling points including blockchain security.",
  "frontend/src/pages/MissionLogPage.tsx": "Mission log page showing today's summary stats (tasks completed, missions completed, XP and coins earned) by aggregating data from the user profile and daily task recommendations.",
  "frontend/src/pages/MissionsPage.tsx": "Missions page listing daily, repeatable, and custom user missions with the ability to complete, create, and delete missions, including cooldown logic and a confirmation dialog for deletion.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Profile settings page allowing the user to view their profile info, edit their username, log out, and delete their account via a confirmation dialog.",
  "frontend/src/pages/SkillsPage.tsx": "Displays all available skills grouped by category, showing unlock status and requirements. Allows users to unlock skills using profile data and the useUnlockSkill mutation.",
  "frontend/src/pages/StatsPage.tsx": "Shows user stats with a radar chart and allows allocation of unspent stat points via increment/decrement controls. Pending allocations are tracked locally and submitted in batch.",
  "frontend/src/utils/cacheControl.ts": "Provides utilities to detect the draft environment and clear service worker caches and registrations. Exports an initializer that auto-clears caches when running on draft.caffeine.xyz.",
  "frontend/src/utils/rankUtils.ts": "Maps a user's numeric level to a rank label, color identifier, and Shadow Monarch flag. Exports the getRankFromLevel helper and the RankInfo type.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, with sessionStorage persistence helpers. Also includes a function to remove specific params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, typography/container-queries/animate plugins, and custom font and animation definitions.",
  "project_state.json": "Tracks project state including existing features, pending feature requests, and architectural notes for the CRYONEX project. Currently has a pending request to add a rank display box to the Command Center page."
}