{
  "backend/main.mo": "Main Motoko actor defining all backend types (Player, UserProfile, Mission, Skill, etc.) and implementing game logic including combat, missions, daily tasks, custom tasks, leaderboard, cheat store purchases, and access control for a gamified productivity app called CRYONEX.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and recent changes of components, pages, hooks, and config files in the CRYONEX frontend.",
  "frontend/.ic-assets.json": "ICP asset configuration file defining HTTP headers (Content-Type, Cache-Control, security headers) for all frontend static asset types served from the canister.",
  "frontend/index.css": "Empty global CSS file for the frontend.",
  "frontend/index.html": "HTML entry point for the CRYONEX PWA, including meta tags for caching, PWA manifest, Apple mobile web app support, favicon links, and Inter font loading.",
  "frontend/public/manifest.json": "PWA manifest for CRYONEX defining app name, icons (192x192 and 512x512), display mode, theme/background colors, and categories (productivity, lifestyle, games).",
  "frontend/public/service-worker.js": "Service worker implementing an offline-first caching strategy with versioned caches for static assets, runtime assets, and API calls, with special handling to bypass caching entirely on the draft environment.",
  "frontend/src/App.tsx": "Root React component managing authentication state, actor initialization with timeout handling, profile/questionnaire loading, retry logic, and routing between all app screens including the cheat store.",
  "frontend/src/components/auth/InitializationError.tsx": "Displays a full-screen error UI when app initialization fails, with options to retry or clear caches/service workers, and shows technical details including draft-environment-specific guidance.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity, handling loading states and clearing the React Query cache on logout.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Displays AI-generated daily tasks with completion status and rewards, auto-refreshing at midnight UTC by invalidating relevant React Query caches.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Small display component that shows the current device date using the `useDeviceDate` hook with a calendar icon.",
  "frontend/src/components/dashboard/RankInfoDialog.tsx": "Modal dialog showing the user's current rank and a full rank progression table with tier colors and avatars based on level thresholds.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Small display component that shows a live-updating clock using the `useRealTimeClock` hook with a clock icon.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application shell providing a header with branding and login button, a collapsible sidebar navigation, and an offline indicator banner.",
  "frontend/src/components/layout/OfflineIndicator.tsx": "Fixed-position banner that appears at the top of the screen when the user is offline, using the `useOnlineStatus` hook.",
  "frontend/src/components/missions/CustomMissionForm.tsx": "A form component for creating custom missions with title, description, XP reward, and coin reward fields, including validation and submission via the useCreateUserMission hook.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "A confirmation alert dialog that warns users about permanent account deletion and lists all data that will be removed, with Cancel and Delete Account actions.",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "A multi-step dialog questionnaire that collects user personalization answers via radio options, showing a progress bar and navigation between questions before submitting via useSubmitQuestionnaireAnswers.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "A modal dialog for new users to set a nickname and initialize their profile using the useInitializeProfile hook, blocking dismissal until submitted.",
  "frontend/src/components/stats/StatsRadarChart.tsx": "Renders a Recharts radar chart visualizing an array of bigint stat values mapped to named axes, with styled grid, tooltip, and responsive container.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "A form for creating custom tasks with a title, XP points (1–100), and attribute points (1–10), using increment/decrement buttons and submitting via useCreateCustomTask.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays user-created tasks in a card list separated into active and completed sections, with toggle completion buttons and loading/error/empty states.",
  "frontend/src/content/copy.ts": "Exports a centralized COPY object containing all UI text strings for the app, including auth, profile setup, dashboard, missions, and personalization questionnaire content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, handling both anonymous and authenticated identities, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeviceDate.ts": "Custom hook that returns the current date formatted as DD/MM/YY and updates automatically at midnight each day.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity state tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Custom hook that monitors browser network connectivity and returns a boolean indicating whether the user is currently online.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for interacting with the backend actor, covering user profile, questionnaire, missions, skills, inventory, leaderboard, and other game data operations.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom hook that returns the current time as a HH:MM:SS string, updating every second.",
  "frontend/src/index.css": "Global stylesheet that configures Tailwind CSS, defines CSS custom properties for light and dark sci-fi themes, and sets a fixed background image with glass-overlay utility classes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CheatStorePage.tsx": "Displays a store where users can spend credits on cheat/reward items, showing daily purchase limits, remaining uses, and handling purchase mutations with loading and sold-out states.",
  "frontend/src/pages/CustomTasksPage.tsx": "Renders a page with a form to create custom tasks and a list of existing custom tasks, using card layout and copy constants for text.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard showing the user's profile stats, rank badge with avatar, XP progress, credits, a radar chart of skill stats, a real-time clock, calendar, and a quick custom task form.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with a hero section, login button, and a four-feature marketing grid highlighting the app's gamification and blockchain security aspects.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a ranked leaderboard of users with podium styling for the top 3, rank-colored badges and avatars, and highlights the current user's row.",
  "frontend/src/pages/MissionLogPage.tsx": "Shows a mission log page summarizing today's completed tasks, missions, XP earned, and coins earned, fetched from the user profile and daily task recommendations.",
  "frontend/src/pages/MissionsPage.tsx": "Displays daily, repeatable, and custom user missions with completion tracking, cooldown logic, and delete confirmation dialogs. Allows users to complete or delete missions and toggle a custom mission creation form.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Shows the user's profile information with options to edit username, view stats/level, logout, and delete the account via a confirmation dialog.",
  "frontend/src/pages/SkillsPage.tsx": "Renders available and unlocked skills grouped by category, plus discipline skills with tier labels, allowing users to unlock skills based on level and stat requirements.",
  "frontend/src/pages/StatsPage.tsx": "Displays the user's 13 attributes with a radar chart and controls to allocate unspent stat points, previewing pending changes before confirming.",
  "frontend/src/utils/cacheControl.ts": "Provides utilities to detect the draft environment, clear service worker caches, unregister service workers, and perform hard reloads for cache busting.",
  "frontend/src/utils/rankUtils.ts": "Maps a user's level to a rank title (E through Shadow Monarch) with associated color identifiers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom colors (using oklch), border radius, fonts, animations, and enabling dark mode, typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file describing two pending tasks: adding a small batch of discipline skills to the backend skill matrix in main.mo (AR-1) and updating the frontend SkillsPage.tsx to display the new skills (AR-2)."
}