{
  "kind": "build_request",
  "title": "Add next small batch of skills to the skill matrix",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a small batch of discipline skills (no more than 5 at a time) to the backend skill matrix in main.mo, continuing from where the previous batch left off. Each skill should include all required fields (id, name, description, category, stat requirements, level requirement, unlock status defaults).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Smaller sets of skills"
        ]
      },
      "acceptanceCriteria": [
        "Up to 5 new discipline skills are added to the backend skill matrix without causing a build failure",
        "Each new skill has all required fields populated correctly",
        "Existing skills and game state are preserved"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the frontend SkillsPage.tsx to display the newly added batch of skills, grouped by category and showing unlock status and requirements consistently with existing skill entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Smaller sets of skills"
        ]
      },
      "acceptanceCriteria": [
        "Newly added skills appear in the correct category group on the Skills page",
        "Unlock requirements and status are displayed correctly for new skills",
        "Existing skill display is not broken"
      ]
    }
  ],
  "constraints": [
    "Add no more than 5 skills in this batch to avoid build failures",
    "Do not modify frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui",
    "Preserve all existing skills and player state"
  ],
  "nonGoals": [
    "Adding all 39 skills in a single batch",
    "Modifying combat or mission logic",
    "Changing the skill unlock mechanism or UI layout"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}