{
  "backend/main.mo": "Main backend actor implementing a gamified productivity system with user profiles, stats, missions, skills, daily tasks, custom tasks, combat mechanics, and authorization controls using Motoko.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of automatic midnight refresh for daily tasks in the DailyTasksSection component with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration with details on responsive design, CRYONEX branding, and React Query integration.",
  "frontend/index.css": "Empty global CSS file (content truncated or empty).",
  "frontend/index.html": "HTML entry point with PWA manifest, cache control meta tags for draft environments, Apple PWA support, Inter font preloading, and CRYONEX branding.",
  "frontend/public/manifest.json": "PWA manifest defining CRYONEX app metadata, icons, theme colors, display mode (standalone), and categorization as productivity/lifestyle/games.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets with draft environment detection that bypasses caching, version-based cache management, and network-first for API calls.",
  "frontend/src/App.tsx": "Main app component managing authentication flow, initialization with 10-second timeout, retry logic (up to 3 attempts), actor readiness monitoring, profile/questionnaire setup dialogs, and screen routing between dashboard, missions, stats, skills, profile, and custom tasks.",
  "frontend/src/components/auth/InitializationError.tsx": "Error component displaying initialization failures with retry and cache-clearing options, draft environment detection, collapsible technical details, and user-friendly error messaging.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that uses Internet Identity authentication, manages login state with processing indicators, and clears the query cache on logout.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Displays AI-generated daily tasks with completion tracking, reward badges (XP/coins/energy), and auto-refreshes at midnight UTC. Shows both incomplete and completed tasks with progress indicators.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Simple date display component showing the current device date in MM/DD/YY format with a calendar icon.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Real-time clock component displaying HH:MM:SS format time with a clock icon, updating continuously.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with collapsible sidebar navigation, hamburger menu for mobile, header with logo and login button, and navigation to six main screens (dashboard, missions, custom tasks, stats, skills, profile).",
  "frontend/src/components/missions/CustomMissionForm.tsx": "Form for creating custom missions with title, description, XP reward, and coin reward fields, including validation and increment/decrement controls for reward values.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "Confirmation dialog for permanent account deletion, listing all data that will be removed (profile, missions, skills, stats, tasks, coins, XP, inventory).",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "Multi-step questionnaire dialog with progress bar and navigation, collecting user answers to personalization questions via radio buttons before submission.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile setup dialog that prompts new users to enter a nickname, with form validation and submission to initialize their profile.",
  "frontend/src/components/stats/StatsRadarChart.tsx": "React component that renders a radar chart visualization for character stats using Recharts library, displaying stat names and values with custom styling in a cyan/blue theme.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "Form component for creating custom tasks with title input, XP points (1-100), and attribute points (1-10) controls using increment/decrement buttons and validation.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays a list of custom tasks separated into active and completed sections, with toggle completion functionality and loading/error states.",
  "frontend/src/content/copy.ts": "Centralized content/copy configuration file containing all UI text strings for the application including auth, dashboard, missions, profile setup, and personalization questions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useDeviceDate.ts": "Hook that returns the current date in DD/MM/YY format and automatically updates at midnight using timeouts and intervals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profile management (get, initialize, update, delete), questionnaire answers, missions, skills, daily task recommendations, and custom tasks with mutations and caching.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom hook that returns a real-time clock string formatted as HH:MM:SS, updating every second.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark sci-fi theme (cyan/green accents), background image setup, and semi-transparent overlay utilities for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CustomTasksPage.tsx": "Page component displaying a form to create custom tasks and a list of existing custom tasks with semi-transparent card styling.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing user stats (level, XP, coins, streak), real-time clock, calendar, daily tasks section, and a radar chart for skill statistics.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, login button, and feature cards highlighting gamification, progress tracking, daily tasks, and blockchain security.",
  "frontend/src/pages/MissionLogPage.tsx": "Mission log page displaying today's progress summary including completed tasks, missions, XP earned, and coins earned with stat cards.",
  "frontend/src/pages/MissionsPage.tsx": "Displays daily, repeatable, and custom user missions with completion tracking, cooldown logic, and CRUD operations for custom missions. Includes a form to create new custom missions and handles mission deletion with confirmation dialog.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides user profile management including username editing, account deletion with confirmation dialog, and logout functionality. Displays user stats, level, and identity information.",
  "frontend/src/pages/SkillsPage.tsx": "Displays categorized skills with unlock requirements based on user level and stats. Shows skill categories with icons and colors, and allows users to unlock skills they meet requirements for.",
  "frontend/src/pages/StatsPage.tsx": "Allows users to allocate unspent stat points across 13 attributes with increment/decrement controls and a radar chart visualization. Includes pending allocation preview and batch commit functionality.",
  "frontend/src/utils/cacheControl.ts": "Provides utilities for managing service worker caches and detecting draft environments. Includes functions to clear caches, unregister service workers, add cache-busting parameters, and perform hard reloads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing. Supports sessionStorage persistence and parameter cleanup from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (using OKLCH color space), typography, container queries, animations, and theme extensions including cyber/neon/metal colors and accordion keyframes.",
  "project_state.json": "Project state metadata tracking feature requests for automatic daily AI task generation at midnight, including backend timer implementation and frontend auto-refresh functionality for the DailyTasksSection component."
}