{
  "backend/main.mo": "Main Motoko actor implementing a gamified productivity system with user profiles, stats, missions, skills, daily tasks, combat mechanics, and authorization controls.",
  "feature_evidence.json": "Feature evidence report documenting PWA icon generation from Cryonex logo in 192x192px and 512x512px sizes with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration with details on responsive design, authentication, and CRYONEX branding.",
  "frontend/index.css": "Empty global CSS file (content truncated or empty).",
  "frontend/index.html": "HTML entry point with PWA manifest, cache control meta tags for draft environment, Apple PWA support, theme color configuration, and Inter font preloading.",
  "frontend/public/manifest.json": "PWA manifest defining CRYONEX app metadata, standalone display mode, dark theme colors, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets with draft environment detection that bypasses caching, version-based cache management, and network-first for API calls.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile initialization, questionnaire state, screen navigation, retry logic with exponential backoff, and timeout handling for actor creation.",
  "frontend/src/components/auth/InitializationError.tsx": "Error component displaying initialization failures with retry options, cache clearing functionality, draft environment detection, and expandable technical details.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication, manages login state with processing indicators, and clears the query cache on logout.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Displays AI-generated daily tasks with completion tracking, reward badges (XP/coins/energy), and auto-refreshes at midnight UTC. Shows both incomplete and completed tasks with visual progress indicators.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Simple component displaying the current date in MM/DD/YY format using a device date hook with calendar icon.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Displays a real-time clock in HH:MM:SS format using a custom hook, styled with monospace font and clock icon.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with collapsible sidebar navigation, hamburger menu for mobile, header with logo and login button, and navigation to six main screens (dashboard, missions, custom tasks, stats, skills, profile).",
  "frontend/src/components/missions/CustomMissionForm.tsx": "Form for creating custom missions with title, description, XP reward, and coin reward fields. Includes validation, increment/decrement controls for rewards, and form reset on successful submission.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "Confirmation dialog for permanent account deletion that lists all data to be removed (profile, missions, skills, stats, tasks, coins, XP) with warning styling.",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "Multi-step questionnaire dialog with 5 questions, radio button options, progress bar, navigation controls, and submission of answers for AI personalization. Cannot be dismissed until completed.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile setup dialog that prompts new users to enter a nickname, cannot be dismissed, and triggers profile initialization on submission.",
  "frontend/src/components/stats/StatsRadarChart.tsx": "React component that renders a radar chart visualization for character stats using Recharts library, displaying stat names and values with custom styling in cyan/blue theme.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "Form component for creating custom tasks with title input, XP points (1-100), and attribute points (1-10) using increment/decrement buttons, integrating with useCreateCustomTask hook.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays custom tasks separated into active and completed sections with toggle completion functionality, showing XP and attribute point badges for each task.",
  "frontend/src/content/copy.ts": "Centralized content/copy configuration object containing all UI text strings for the application including auth, dashboard, missions, profile setup, and personalization flows.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDeviceDate.ts": "Hook that returns current date in DD/MM/YY format and automatically updates at midnight using setTimeout/setInterval.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user profiles, questionnaires, missions, skills, daily tasks, and custom tasks with mutations for CRUD operations and toast notifications.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom React hook that returns a real-time clock string formatted as HH:MM:SS, updating every second.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom sci-fi themed color variables for light/dark modes, background image setup, and semi-transparent overlay utilities for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CustomTasksPage.tsx": "Page component displaying a form to create custom tasks and a list of existing custom tasks with semi-transparent card styling.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing user stats (level, XP, coins, streak), real-time clock, calendar, daily tasks section, and a radar chart for skill statistics.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, login button, and feature cards highlighting gamification, progress tracking, daily challenges, and blockchain security.",
  "frontend/src/pages/MissionLogPage.tsx": "Mission log page displaying today's progress summary including completed tasks, missions, and earned XP/coins with stat cards.",
  "frontend/src/pages/MissionsPage.tsx": "Displays daily, repeatable, and custom user missions with completion tracking, cooldown logic, and CRUD operations for custom missions. Includes mission creation form and delete confirmation dialog.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "User profile settings page with username editing, account deletion dialog, logout functionality, and display of user stats (level, coins, XP). Uses Internet Identity for authentication.",
  "frontend/src/pages/SkillsPage.tsx": "Displays categorized skills (physical, mental, productivity, etc.) with unlock requirements based on level and stats. Shows skill status and allows unlocking with XP cost.",
  "frontend/src/pages/StatsPage.tsx": "Allows users to allocate unspent stat points across 13 attributes (Academics, Fitness, etc.) with increment/decrement controls and a radar chart visualization of current stats.",
  "frontend/src/utils/cacheControl.ts": "Provides utilities for clearing service worker caches, unregistering service workers, and detecting draft environment for cache-busting during development.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH color space, including cyber/neon/metal theme colors, extended typography, container queries, and accordion animations.",
  "project_state.json": "Project state tracking file documenting the conversion of a mobile game app to a PWA with Cryonex branding, including pending feature requests for manifest configuration, icon generation, and theme color updates."
}