{
  "backend/main.mo": "Main Motoko actor implementing a gamified progression system with player profiles, stats, missions, skills, daily tasks, custom tasks, combat mechanics, and questionnaire-based personalization.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: username editing interface and account deletion functionality in ProfileSettingsPage with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration files for the CRYONEX gamified progression tracking application.",
  "frontend/index.css": "Empty global CSS file (content appears to be in frontend/src/index.css instead).",
  "frontend/index.html": "HTML entry point for CRYONEX application with Inter font preload, viewport meta tags, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, profile setup, personalization questionnaire, and navigation between dashboard, missions, custom tasks, stats, skills, and profile screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Dashboard card component displaying AI-generated daily tasks with completion tracking, XP/coin rewards display, and active/completed task separation.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Calendar widget displaying current date from device in MM/DD/YY format with accent-colored styling.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Clock widget displaying real-time HH:MM:SS from device with primary-colored styling and monospace font.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header, sidebar navigation (dashboard, missions, custom tasks, stats, skills, profile), scrollable content area, and footer with semi-transparent dark backgrounds.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "A confirmation dialog component that warns users about permanent account deletion and lists all data that will be removed (profile, missions, skills, stats, tasks, coins, XP, inventory).",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "A multi-step questionnaire dialog that collects user preferences across 5 questions (playstyle, mission types, stat priority, skill category, game goals) with progress tracking and navigation controls.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "An initial profile setup dialog that prompts new users to enter a nickname (max 30 characters) to initialize their CRYONEX profile.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "A form component for creating custom tasks with configurable title, XP points (1-100), and attribute points (1-10) using increment/decrement controls.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays user's custom tasks separated into active and completed sections, showing task details (title, XP, attribute points) with toggle completion functionality.",
  "frontend/src/content/copy.ts": "Centralized copy/text content for the entire application including UI labels, messages, and questionnaire questions organized by feature area (auth, profile, missions, stats, etc.).",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDeviceDate.ts": "React hook that returns the current date in DD/MM/YY format and updates automatically at midnight each day.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, providing login/logout functionality, identity management, and authentication status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend API calls including user profile management, questionnaire answers, daily tasks, custom tasks, missions, and skills with optimistic updates and toast notifications.",
  "frontend/src/hooks/useRealTimeClock.ts": "React hook that returns the current time in HH:MM:SS format (24-hour) and updates every second.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom sci-fi themed color variables for light/dark modes featuring cyan/green accents, plus global styles with background image and semi-transparent overlay utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/CustomTasksPage.tsx": "Page component displaying a form to create custom tasks and a list of existing custom tasks with semi-transparent card styling.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page showing user stats (level, XP, coins, streak), real-time clock/calendar, and daily tasks section with progress tracking and sci-fi themed cards.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, login button, and four feature cards highlighting gamification, progression, daily tasks, and blockchain security with sci-fi styling.",
  "frontend/src/pages/MissionsPage.tsx": "Displays daily and repeatable missions with completion status, XP/gold rewards, and level requirements; allows users to complete missions if eligible based on level and cooldown timers.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Provides user profile management including username editing, account deletion with confirmation dialog, and logout functionality; displays user stats like level, XP, gold, and energy.",
  "frontend/src/pages/SkillsPage.tsx": "Displays skills organized by category (physical, mental, social, creative, financial, health, learning, personal) with unlock functionality based on level and skill point requirements.",
  "frontend/src/pages/StatsPage.tsx": "Allows users to allocate unspent stat points across multiple attributes with increment/decrement controls, showing current values, pending allocations, and remaining points before submission.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup capabilities for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, custom animations, and typography/container query plugins.",
  "project_state.json": "Project state tracking username editing and account deletion features for a user profile page. Contains existing frontend features (edit interface, delete button with confirmation) and pending backend requirements (update username function, delete account function)."
}