{
  "backend/main.mo": "Main Motoko actor implementing a gamified task/mission system with player profiles, stats, skills, daily tasks, custom tasks, combat mechanics, XP/leveling, inventory, and authorization controls.",
  "feature_evidence.json": "Feature evidence report documenting the mission log history view feature with high confidence, listing related frontend files and components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing React components, pages, hooks, and styling for the CRYONEX application with mobile-responsive design and dark fantasy aesthetic.",
  "frontend/index.css": "Empty CSS file (no content provided).",
  "frontend/index.html": "HTML entry point with CRYONEX title, Inter font preload, and root div for React mounting.",
  "frontend/src/App.tsx": "Root React component managing authentication flow, profile setup, questionnaire, and navigation between dashboard, missions, mission log, stats, skills, profile, and custom tasks screens.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/dashboard/DailyTasksSection.tsx": "Dashboard card displaying AI-recommended daily tasks with completion tracking, showing active and completed tasks with XP and credit rewards.",
  "frontend/src/components/dashboard/DateCalendar.tsx": "Component displaying current date in MM/DD/YY format with calendar icon and accent styling.",
  "frontend/src/components/dashboard/RealTimeClock.tsx": "Component displaying real-time clock in HH:MM:SS format with clock icon and primary color styling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper with header (logo and login button), sidebar navigation for all app screens including mission log, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/missions/CustomMissionForm.tsx": "Form component for creating custom missions with validation for title, description, XP reward, and coin reward fields. Uses React hooks for state management and mutation hooks for API submission.",
  "frontend/src/components/profile/AccountDeletionDialog.tsx": "Alert dialog component that warns users about permanent account deletion and lists all data that will be removed. Provides cancel and confirm actions.",
  "frontend/src/components/profile/PersonalizationQuestionnaire.tsx": "Multi-step questionnaire dialog with progress tracking that collects user answers across multiple questions. Features navigation between questions and submits all answers on completion.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile setup dialog that prompts new users to enter a nickname. Submits the nickname to initialize the user profile.",
  "frontend/src/components/tasks/CustomTaskForm.tsx": "Form for creating custom tasks with configurable title, points (1-100), and attribute points (1-10). Includes increment/decrement buttons for numeric inputs.",
  "frontend/src/components/tasks/CustomTaskList.tsx": "Displays user's custom tasks separated into active and completed sections with loading and error states. Shows task details including XP points and attribute points with toggle completion functionality.",
  "frontend/src/content/copy.ts": "Exports a COPY object containing all UI text strings and labels for the application, including authentication, profile setup, personalization questions, dashboard, missions, skills, inventory, and custom tasks sections.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages the backend actor instance with authentication, automatically recreating it when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useDeviceDate.ts": "Custom React hook that returns the current date in DD/MM/YY format and automatically updates at midnight each day.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider for the application, managing login state, identity persistence, and authentication lifecycle with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including user profiles, questionnaires, daily tasks, missions, skills, inventory, and custom tasks with mutation handling and toast notifications.",
  "frontend/src/hooks/useRealTimeClock.ts": "Custom React hook that returns the current time in HH:MM:SS format (24-hour) and updates every second.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes featuring sci-fi metallic aesthetics with cyan/green accents, plus background image styling and semi-transparent overlay classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CustomTasksPage.tsx": "Renders the custom tasks page with a header, task creation form card, and task list component using semi-transparent dark styling.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying user profile stats (level, XP, coins, energy), a hero banner with real-time clock and calendar, and a daily tasks section with progress tracking.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, login button, and feature cards showcasing the gamified task management system with blockchain security.",
  "frontend/src/pages/MissionLogPage.tsx": "Mission log page showing today's progress summary including completed tasks/missions count and total XP/coins earned today.",
  "frontend/src/pages/MissionsPage.tsx": "Missions page displaying daily, repeatable, and custom user missions with completion status tracking, custom mission creation form, and mission deletion functionality.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Profile settings page allowing users to view stats, edit username, logout, and delete their account with confirmation dialog.",
  "frontend/src/pages/SkillsPage.tsx": "React component that displays a categorized skill tree with unlock functionality, organizing skills into physical, mental, social, creative, financial, health, learning, and personal care categories with icons and filtering.",
  "frontend/src/pages/StatsPage.tsx": "React component for allocating unspent stat points to user attributes, featuring increment/decrement controls, pending allocation preview, and batch submission of stat changes.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (cyber/neon theme with OKLCH colors), typography, animations, and design tokens for the application's UI system.",
  "project_state.json": "Project metadata tracking feature requests for automated daily task generation and mission log entries at midnight, with AI-driven task recommendations based on user patterns."
}