{
  "backend/main.mo": "Main Motoko actor defining game types (Player, Mob, Mission, Skill, CombatResult, Loot) and global state maps for players, profiles, missions, and skills with access control integration.",
  "feature_evidence.json": "Feature evidence report documenting implementation of custom background image, dark theme maintenance, and white/near-white font colors across all application pages.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend files describing authentication flow, profile setup, page layouts with semi-transparent dark overlays, and white text for visibility.",
  "frontend/index.css": "Empty CSS file (content truncated or not provided).",
  "frontend/index.html": "HTML entry point with Inter font from Google Fonts, CRYONEX title, and root div for React mounting.",
  "frontend/src/App.tsx": "Main React component managing authentication state, profile setup flow for all auth methods including Google, and screen navigation between Dashboard, Missions, Stats, Skills, and Profile pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component using Internet Identity with simplified styling, loading states, and query client clearing on logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, sidebar navigation, and footer using semi-transparent dark backgrounds (rgba(0,0,0,0.8)) with backdrop blur and white/near-white text for visibility.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Profile setup dialog with semi-transparent dark background (rgba(0,0,0,0.9)), white text, nickname input, and identity security note for first-time users.",
  "frontend/src/content/copy.ts": "Exports a centralized COPY object containing all UI text strings for the application, organized by feature area (app, auth, profile, dashboard, missions, stats, skills, landing).",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for the application, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including profile management, stats allocation, mission completion, and skill unlocking, with integrated toast notifications and cache updates.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark sci-fi themed color schemes (cyan/green accents), background image setup, and semi-transparent overlay utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component displaying user profile overview with level, XP progress, coins, unspent points, and progression summary cards using a sci-fi themed UI with semi-transparent overlays.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero section, feature cards (combat, progression, real-time, blockchain security), and login button. Uses dark theme with backdrop blur effects and sci-fi hero image.",
  "frontend/src/pages/MissionsPage.tsx": "Displays daily and repeatable missions with completion status, requirements, and rewards. Handles mission completion logic including level checks and daily cooldown validation.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Shows user profile information including nickname, principal ID, stats overview (level, coins, unspent points), and logout functionality. Displays progress summary and identity details.",
  "frontend/src/pages/SkillsPage.tsx": "Displays skill tree with unlock requirements based on level and stat thresholds. Shows locked/unlocked status and allows users to unlock skills if requirements are met.",
  "frontend/src/pages/StatsPage.tsx": "Allows users to allocate unspent stat points across multiple attributes with increment/decrement controls. Shows current values, pending allocations, and remaining points before submission.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state file tracking CRYONEX app features including custom dark background image implementation and white font color adjustments for visibility."
}