{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend for Mission Log History View",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a mission log history view displaying automated daily log entries with date, completed activities, and rewards",
      "acceptanceCriteria": [
        "Mission log is accessible from the main navigation or dashboard",
        "Log entries are displayed in reverse chronological order (newest first)",
        "Each entry shows the date, completed tasks/missions count, and rewards (XP/coins)",
        "UI follows existing design system with cyber/neon theme styling"
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Add TypeScript interface definitions for MissionLogEntry type returned by the backend, including fields for date (Time), completedTasksCount (bigint), completedMissionsCount (bigint), xpEarned (bigint), and coinsEarned (bigint). Also add backend method signature: listMissionLogEntries(): Promise<Array<MissionLogEntry>>."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useListMissionLogEntries() that fetches mission log entries from the backend using the listMissionLogEntries method. Include proper query key, error handling with toast notifications, and enabled state tied to actor availability. Follow the existing pattern used for other list queries in this file."
        },
        {
          "path": "frontend/src/pages/MissionLogPage.tsx",
          "operation": "create",
          "description": "Create a new page component that displays mission log history in a card-based layout. Use useListMissionLogEntries hook to fetch data. Display entries in reverse chronological order with date formatting, completed tasks/missions counts, and XP/coins earned. Include loading and error states. Style using existing Tailwind classes with cyber/neon theme (bg-card/25, border-primary/20, text-accent, etc.). Use the AppLayout wrapper for consistent navigation."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a new navigation item for 'Mission Log' in the sidebar navigation array. Include an appropriate icon (e.g., ScrollText from lucide-react) and set the path to '/mission-log'. Position it after 'Missions' and before 'Custom Tasks' for logical grouping of mission-related features."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a new route for the MissionLogPage component at path '/mission-log'. Import MissionLogPage and add it to the router configuration between the missions route and custom-tasks route. Ensure it is wrapped in the authenticated section after profile setup and questionnaire completion."
        },
        {
          "path": "frontend/src/content/copy.ts",
          "operation": "modify",
          "description": "Add a new 'missionLog' section to the copy object containing UI text for the mission log page, including page title ('Mission Log History'), empty state message ('No mission log entries yet. Complete tasks and missions to see your daily progress here.'), and column headers ('Date', 'Tasks Completed', 'Missions Completed', 'XP Earned', 'Coins Earned')."
        }
      ]
    }
  ]
}