{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add username editing and account deletion to profile page",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add username edit interface to the ProfileSettingsPage with editable input field, save button, and success/error feedback using toast notifications",
      "acceptanceCriteria": [
        "Profile page displays current username in an editable field",
        "Save button triggers username update via backend mutation",
        "Success toast appears when username is updated successfully",
        "Error toast appears if update fails",
        "Profile data refreshes after successful update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfileSettingsPage.tsx",
          "operation": "modify",
          "description": "Add username editing section with input field and save button. Use the existing useGetCallerUserProfile hook to display current username. Create a mutation hook call for updateUsername backend function. Wire up save button to trigger the mutation with validation for non-empty username. Display toast notifications for success/error feedback. Ensure profile data refreshes after successful update using query invalidation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateUsername mutation hook that calls actor.updateUsername(newUsername). Include onSuccess callback to invalidate currentUserProfile query and show success toast. Include onError callback to show error toast with appropriate message. Follow existing mutation patterns in the file."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add account deletion button to ProfileSettingsPage with confirmation dialog, explaining that this action is permanent and will delete all progress, then logout and redirect to landing page after deletion",
      "acceptanceCriteria": [
        "Delete account button is prominently displayed on profile page with warning styling",
        "Clicking delete button opens confirmation dialog explaining permanent data loss",
        "Confirmation dialog has cancel and confirm delete buttons",
        "Upon confirmation, account deletion mutation is triggered",
        "After successful deletion, user is logged out and redirected to landing page",
        "Error toast appears if deletion fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/AccountDeletionDialog.tsx",
          "operation": "create",
          "description": "Create confirmation dialog component using shadcn/ui Dialog component. Display warning message explaining that account deletion is permanent and will delete all progress including tasks, missions, stats, and skills. Include two buttons: Cancel (closes dialog) and Confirm Delete (styled with destructive/danger colors). Accept onConfirm callback prop to trigger deletion. Use consistent styling with existing dialogs in the codebase."
        },
        {
          "path": "frontend/src/pages/ProfileSettingsPage.tsx",
          "operation": "modify",
          "description": "Add Delete Account button section at the bottom of the profile page with warning/danger styling (red color scheme). Import and render AccountDeletionDialog component with state to control open/close. Wire the dialog's onConfirm to trigger the account deletion mutation. After successful deletion, call Internet Identity clear() function to logout and navigate to landing page using the app's navigation system."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useDeleteAccount mutation hook that calls actor.deleteAccount(). Include onSuccess callback to clear query cache, logout via Internet Identity clear(), and show success toast. Include onError callback to show error toast with appropriate message. Follow existing mutation patterns in the file."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure that after logout (identity becomes null), the app properly redirects to LandingPage. Verify the existing authentication flow handles the logout-after-deletion scenario correctly, showing LandingPage when identity is cleared."
        }
      ]
    }
  ]
}